#+FILETAGS: :web-utils:

* backlog
** separate tests into different system
** TODO memoize
   :CLOCK:
   CLOCK: [2014-02-13 Thu 17:07]--[2014-02-13 Thu 17:28] =>  0:21
   CLOCK: [2014-02-13 Thu 16:28]--[2014-02-13 Thu 17:04] =>  0:36
   CLOCK: [2014-02-13 Thu 16:12]--[2014-02-13 Thu 16:23] =>  0:11
   CLOCK: [2014-02-11 Tue 17:26]--[2014-02-11 Tue 17:31] =>  0:05
   CLOCK: [2014-02-11 Tue 16:43]--[2014-02-11 Tue 17:24] =>  0:41
   :END:
   -
(defun fib (n)
  (if (< n 3)
      1
      (+ (fib (1- n)) (fib (- n 2)))))
** TODO write tests
   :CLOCK:
   CLOCK: [2014-02-04 Tue 16:16]--[2014-02-04 Tue 16:18] =>  0:02
   CLOCK: [2014-02-04 Tue 15:42]--[2014-02-04 Tue 16:16] =>  0:34
   CLOCK: [2014-01-28 Tue 16:29]--[2014-01-28 Tue 16:35] =>  0:06
   CLOCK: [2014-01-28 Tue 15:58]--[2014-01-28 Tue 16:09] =>  0:11
   CLOCK: [2014-01-27 Mon 13:52]--[2014-01-27 Mon 14:13] =>  0:21
   :END:
   - http://msnyder.info/posts/2011/07/lisp-for-the-web-part-ii/
** move common functionality (including (partial) views)
   - [ ] login
** [refactor] utils/list/make-set
   - rename to remove-duplicates
   - why is it needed in model/article/get-active-articles (the original list already does not contain duplicates)
   - and other places too? ???
** TODO [bug] image-upload should convert transparent background to white
   :CLOCK:
   CLOCK: [2014-02-13 Thu 15:44]--[2014-02-13 Thu 16:11] =>  0:27
   CLOCK: [2014-02-13 Thu 14:18]--[2014-02-13 Thu 15:11] =>  0:53
   :END:
** Archive                                                          :ARCHIVE:
*** DONE [bug] image resizing output is not good
    CLOSED: [2014-01-30 Thu 20:12]
    :PROPERTIES:
    :ARCHIVE_TIME: 2014-01-30 Thu 20:12
    :END:
